Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: If you did the Kafka quickstart, you have realized that it's the same code. The only difference is the connector configuration and the JSON mapping.
zh_cn: 如果你学过Kafka快速入门，你会意识到这是相同的代码。唯一的区别是连接器配置和JSON映射。

source: If you do not want to use the mock event server, you can test your lambdas with SAM CLI.
zh_cn: 如果你不想使用模拟事件服务器，你可以用SAM CLI测试lambdas。

source: If you don't have a Redis service running locally, you can run Redis in a Docker container:
zh_cn: 如果你没有本地运行的Redis服务，可以在Docker容器中运行Redis：

source: If you don't want to bother defining getters/setters for your entities, you can make them extend `PanacheEntityBase` and Quarkus will generate them for you. You can even extend `PanacheEntity` and take advantage of the default ID it provides.
zh_cn: 如果你不想自己定义实体的getter和setter方法，可以让实体类继承 `PanacheEntityBase` ，Quarkus将自动生成getter和setter方法。你也可以继承 `PanacheEntity` ，相比 `PanacheEntityBase` ，其优势是它还提供默认的ID字段。

source: If you don't want to create a deserializer for each data object, you can use the generic `io.vertx.kafka.client.serialization.JsonObjectDeserializer` that will deserialize to a `io.vertx.core.json.JsonObject`. The corresponding serializer can also be used: `io.vertx.kafka.client.serialization.JsonObjectSerializer`.
zh_cn: 如果您不想为每个数据对象创建一个反序列化器，您可以使用通用的 `io.vertx.kafka.client.serialization.JsonObjectDeserializer` ，它将把消息反序列化为一个 `io.vertx.core.json.JsonObject` 。也可以使用与之相对应的序列化器： `io.vertx.kafka.client.serialization.JsonObjectSerializer` 。

source: If you don't want to generate a new project, add the dependency in your build file:
zh_cn: 如果你不想生成一个新的项目，可以在你的构建文件中添加该依赖关系：

source: If you enable the `staging` profile, the HTTP port will be 8082, whereas it would be 8081 otherwise.
zh_cn: 如果你启用了 `staging` 环境配置，HTTP 端口将会是 8082，反之，端口将会是 8081。

source: If you encounter the following error when running your application in native mode: + `Failed to encode 'MyObject'. Encoding 'myVariable' errored with: Can't find a codec for class org.acme.MyVariable.` + This means that the `org.acme.MyVariable` class is not known to GraalVM, the remedy is to add the `@RegisterForReflection` annotation to your `MyVariable class`. More details about the `@RegisterForReflection` annotation can be found on the xref:writing-native-applications-tips.adoc#registerForReflection[native application tips] page.
zh_cn: 如果你在本地模式下运行你的应用程序时遇到以下错误。+ `Failed to encode 'MyObject'. Encoding 'myVariable' errored with: Can’t find a codec for class org.acme.MyVariable.` + 这意味着GeralVM不知道 `org.acme.MyVariable` 类，补救措施是将 `@RegisterForReflection` 注解添加到你的 `MyVariable class` 。关于 `@RegisterForReflection` 注解的更多细节可以在 link:writing-native-applications-tips.html#registerForReflection[本地应用程序提示] 页面找到。

source: If you followed the instructions, you should have the Redis server running. Then, you just need to run the application using:
zh_cn: 如果你已按上文指引操作，则应该已经运行了Redis服务。然后需要用以下方法运行应用程序：

source: If you have a single connector on your classpath, you can omit the `connector` attribute configuration. Quarkus automatically associates _orphan_ channels to the (unique) connector found on the classpath. _Orphans_ channels are outgoing channels without a downstream consumer or incoming channels without an upstream producer.
zh_cn: 如果在你的classpath上有一个连接器，你可以省略 `connector` 属性配置。Quarkus会自动将 _orphan_ 通道与classpath上找到的（唯一的）连接器联系起来。 _Orphans_ 通道是没有下游消费者的传出通道或没有上游生产者的传入通道。

source: If you have generated the application from the previous tutorial, you can find in the `pom.xml` the following _profile_:
zh_cn: 如果你已经从前面的教程中生成了应用程序，你可以在 `pom.xml` ，找到以下 _profile_：

source: If you have https://curl.se/[curl] on your machine, you can try the endpoint using:
zh_cn: 如果在您的机器安装了 https://curl.se/[curl]命令，便可以尝试使用端点：

source: If you have multiple JDK's installed it is not certain Maven will pick up the expected java and you could end up with unexpected results. You can verify which JDK Maven uses by running `mvn --version`.
zh_cn: 如果你安装了多个JDK，那么Maven不一定能找到预期的java，你可能会得到意想不到的结果。你可以通过运行 `mvn --version` ，验证Maven使用哪个JDK。

source: If you have started from the Getting Started example you should already have a completed test, including the correct tooling setup.
zh_cn: 如果您已从入门的例子开始，那您应该已经有了一个完成的测试例子，包括正确的安装了工具。

source: If you include the jpa-modelgen annotation processor this will exclude the Panache annotation processor by default. If you do this you should either create the marker file yourself, or add the `quarkus-panache-common` as well, as shown below:
zh_cn: 如果你的项目包含 jpa-modelgen 注解处理器，则默认情况下会排除 Panache 注解处理器。这种情况下，你应该自己创建标记文件，或者添加 `quarkus-panache-common` 插件，如下所示：

source: If you look at the three generated handler classes in the project, you'll see that they are `@Named` differently.
zh_cn: 如果你查看项目中生成的三个处理程序类，你会发现它们的 `@Named` 不同。

source: If you need SSL support in your native executable, you can easily include the necessary libraries in your Docker image.
zh_cn: 如果你的原生可执行文件需要SSL支持，你可以轻松地在Docker镜像中包含必要的库。

source: If you need a lightweight library for the remote introspection of opaque or JWT tokens, use `quarkus-elytron-security-oauth2`.
zh_cn: 如果您需要一个轻量级的库来进行不透明或JWT token 的远程自查，请使用 `quarkus-elytron-security-oauth2` 。

source: If you need more configuration properties, there is a full list at the end of this guide.
zh_cn: 如果你需要更多的配置属性，在本指南的末尾有一个完整的列表。

source: If you need multiple (shared) brokers, you can configure the `quarkus.amqp.devservices.service-name` attribute and indicate the broker name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `amqp`.
zh_cn: 如果你需要多个（共享的）代理，你可以配置 `quarkus.amqp.devservices.service-name` 属性，并指定代理的名字。它会查找一个具有同样值的容器，如果找不到，就会启动一个新的容器。默认的服务名称是 `amqp` 。

source: If you need multiple (shared) brokers, you can configure the `quarkus.kafka.devservices.service-name` attribute and indicate the broker name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `kafka`.
zh_cn: 如果您需要多个（共享的）broker，您可以配置 `quarkus.kafka.devservices.service-name` 属性并指明broker的名称。它会查询一个具有相同名称的容器，如果找不到的话就启动一个新的容器。默认的服务名称是 `kafka` 。

source: If you need multiple (shared) registries, you can configure the `quarkus.apicurio-registry.devservices.service-name` attribute and indicate the registry name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `apicurio-registry`.
zh_cn: 如果你需要多个（共享）注册表，你可以配置 `quarkus.apicurio-registry.devservices.service-name` 属性，并指示注册表名称。它会寻找一个具有相同值的容器，如果找不到，就启动一个新容器。默认的服务名称是 `apicurio-registry` 。

source: If you need multiple (shared) servers, you can configure the `quarkus.redis.devservices.service-name` attribute and indicate the server name. It looks for a container with the same value, or starts a new one if none can be found. The default service name is `redis`.
zh_cn: 如果需要多个（共享的）Dev Services，可以用 `quarkus.redis.devservices.service-name` 属性指定服务名称。Quarkus将尝试查找具有相同服务名称的容器，如果找不到，则启动一个新容器。默认的服务名称是 `redis` 。

source: If you need to access JWT token claims then you can inject `JsonWebToken`:
zh_cn: 如果你需要访问JWT令牌声明，那么你要注入 `JsonWebToken` ：

source: If you need to customize the compiler flags used by `kotlinc` in development mode, you can configure them in the quarkus plugin:
zh_cn: 如果您需要定制 `kotlinc` 在开发模式下使用的编译标志（compiler flags），您可以在quarkus插件中配置它们。

source: If you need to delay the initialization of a class, you can use the `--initialize-at-run-time=<package or class>` configuration knob.
zh_cn: 如果你需要延迟一个类的初始化，你可以使用 `--initialize-at-run-time=<package or class>` 配置旋钮。

source: If you need to do some integration testing against Keycloak then you are encouraged to do it with <<integration-testing-keycloak-devservices,Dev Services For Keycloak>>. Use `KeycloakTestResourceLifecycleManager` for your tests only if there is a good reason not to use `Dev Services for Keycloak`.
zh_cn: 如果你需要对Keycloak做一些集成测试，那么我们鼓励你使用 link:#integration-testing-keycloak-devservices[Keycloak开发服务] 来做。只有在有充分理由不使用 `Keycloak开发服务` 的情况下，才使用 `KeycloakTestResourceLifecycleManager` 进行测试。

source: If you need to enable the Quarkus OIDC extension at runtime, set `quarkus.oidc.tenant-enabled=false` at build time and then re-enable it at runtime by using a system property. For more information about managing the individual tenant configurations in multitenant OIDC deployments, see the _Disabling tenant configurations_ section in the xref:security-openid-connect-multitenancy.adoc#disable-tenant[Using OpenID Connect (OIDC) multi-tenancy] guide.
zh_cn: 如果您想在运行时启用Quarkus OIDC扩展，那么在构建时设置 `quarkus.oidc.tenant-enabled=false` ，并在运行时使用系统属性重新启用它。更多关于管理多租户OIDC部署中各个租户配置的信息，请参见 link:security-openid-connect-multitenancy.html#disable-tenant[禁用租户配置] 。

source: If you need to have access to the full AWT support, you need more than just `libfreetype.so`, but also the font and font configurations:
zh_cn: 如果你需要获得对AWT的完整支持，你需要的不仅仅是 `libfreetype.so` ，同时还需要字体和字体配置:

source: If you need to introspect the JWT tokens remotely, you can use either `quarkus-oidc` or `quarkus-elytron-security-oauth2` because they support the verification of the opaque or binary tokens by using remote introspection. `quarkus-smallrye-jwt` does not support the remote introspection of both opaque or JWT tokens but instead relies on the locally available keys that are usually retrieved from the OpenID Connect provider.
zh_cn: 如果您需要进行JWT tokens远程自查，您可以使用 `quarkus-oidc` 或 `quarkus-elytron-security-oauth2` ，因为它们支持通过使用远程自查来验证不透明或二进制token。 `quarkus-smallrye-jwt` 不支持对不透明或JWT token进行远程自查，而是依赖于通常从OpenID Connect提供者那里检索的本地可用密钥。

source: If you need to mock entity instance methods, such as `persist()` you can do it by mocking the Hibernate ORM `Session` object:
zh_cn: 如果你需要模拟实体类的实例方法，比如 `persist()` ，可以通过模拟Hibernate ORM的 `Session` 对象来实现：

source: If you need to mock entity instance methods, such as `persist()` you can do it by mocking the Hibernate Reactive `Mutiny.Session` object:
zh_cn: 如果你需要模拟实体类的实例方法，比如 `persist()` ，可以通过模拟Hibernate Reactive的 `Mutiny.Session` 对象来实现：

source: If you need to propagate your transaction context across your reactive pipeline, please see the xref:context-propagation.adoc[Context Propagation guide].
zh_cn: 如果你需要在你的响应式管道中传播你的事务上下文，请看 link:context-propagation.html[上下文传播指南] 。

source: If you need to provide your own factory, for example, to avoid verifying the tokens again which have already been verified by the firewall, then you can either use a `ServiceLoader` mechanism by providing a `META-INF/services/io.smallrye.jwt.auth.principal.JWTCallerPrincipalFactory` resource or simply have an `Alternative` CDI bean implementation like this one:
zh_cn: 如果你需要提供你自己的工厂，例如，避免再次验证已经被防火墙验证过的令牌，那么你可以通过提供 `META-INF/services/io.smallrye.jwt.auth.principal.JWTCallerPrincipalFactory` 资源来使用 `ServiceLoader` 机制，或者干脆像这样有一个 `Alternative` CDI bean 实现：

source: If you need to send a Kafka record, use:
zh_cn: 如果您需要发送一条Kafka记录，请使用：

source: If you need to use `mongo+srv://` in native mode, you can configure an alternative DNS resolver. This feature is **experimental** and may introduce a difference between JVM applications and native applications.
zh_cn: 如果你需要在原生模式下使用 `mongo+srv:` ，你可以配置一个备用的DNS解析器。此功能是**实验性**的，可能会在 JVM 应用程序和本机应用程序之间产生差异。

source: If you need to use a custom sampler or to use one that is provided by one of the https://github.com/open-telemetry/opentelemetry-java/tree/main/sdk-extensions[OpenTelemetry SDK Extensions] you can create a sampler producer. The OpenTelemetry extension will detect the `Sampler` CDI bean and will use it when configuring the tracer producer.
zh_cn: 如果您需要使用一个自定义的采样器或使用一个由 link:https://github.com/open-telemetry/opentelemetry-java/tree/main/sdk-extensions[OpenTelemetry SDK扩展] 提供的采样器，您可以创建一个采样器生成器。OpenTelemetry扩展将检测到 `Sampler` CDI bean，并在配置tracer生成器时使用它。

source: If you need to verify the token signature using the asymmetric RSA or Elliptic Curve (EC) key then use the `mp.jwt.verify.publickey.location` property to refer to the local or remote verification key.
zh_cn: 如果你需要使用非对称RSA或椭圆曲线（EC）密钥来验证令牌签名，那么请使用 `mp.jwt.verify.publickey.location` 属性来参考本地或远程验证密钥。

source: If you need to verify the token signature using the symmetric secret key then either a `JSON Web Key` (JWK) or `JSON Web Key Set` (JWK Set) format must be used to represent this secret key, for example:
zh_cn: 如果你需要使用对称密匙验证令牌签名，那么必须使用 `JSON Web Key` （JWK）或 `JSON Web Key Set` （JWK Set）格式来呈现这个密匙，例如：

source: If you need to write accessors, you can:
zh_cn: 如果你需要编写访问器，你可以这样编写：

source: If you open the generated build file, you can see the selected extensions:
zh_cn: 如果你打开生成的构建文件，你可以看到以下选定的扩展:

source: If you plan to consume your OpenID Connect `service` application from a Single Page Application running on a different domain, you will need to configure CORS (Cross-Origin Resource Sharing). Please read the xref:http-reference.adoc#cors-filter[HTTP CORS documentation] for more details.
zh_cn: 如果你打算从运行在不同域的单页应用中使用你的OpenID Connect `service` 应用程序，你将需要配置CORS（跨源资源共享）。请阅读 link:http-reference.html#cors-filter[HTTP CORS文档] 以了解更多细节。

source: If you plan to use external modules (for example, an external library for all your domain objects), you will need to make these modules known to the indexing process either by adding the Jandex plugin (if you can modify them) or via the `quarkus.index-dependency` property inside your `application.properties` (useful in cases where you can't modify the module).
zh_cn: 如果你计划使用外部模块（例如，一个用于你所有领域对象的外部库），你将需要通过添加Jandex插件（如果你能修改它们）或通过 `application.properties` 里的属性`quarkus.index-dependency` （在你不能修改模块的情况下很有用）使这些模块为索引过程所知。

source: If you prefer to use Gradle, you can quickly and easily generate a Gradle project via https://code.quarkus.io/[code.quarkus.io] adding the `quarkus-amazon-lambda` extension as a dependency.
zh_cn: 如果你喜欢使用Gradle，你可以通过 link:https://code.quarkus.io/[code.quarkus.io] 将 `quarkus-amazon-lambda` 扩展添加为依赖项，来快速而轻松地生成一个Gradle项目。

source: If you prefer to use Spring Boot `@ConfigurationProperties` annotated class to access application properties instead of a Quarkus native `@ConfigProperties` or a MicroProfile `@ConfigProperty` approach, you can do that with this extension.
zh_cn: 如果你更喜欢使用Spring Boot `@ConfigurationProperties` 注解类来访问应用程序的属性，而不是Quarkus本地的 `@ConfigProperties` 或MicroProfile `@ConfigProperty` 的注解方式，你可以通过使用该扩展来做到这一点。

source: If you prefer using Reactive Stream APIs, you can use `MutinyEmitter` that will return `Uni<Void>` from the `send` method. You can therefore use Mutiny APIs for handling downstream messages and errors.
zh_cn: 如果您偏好于使用Reactive Stream APIs，您可以使用 `MutinyEmitter` ，它将在 `send` 方法中返回 `Uni<Void>` 。因此，您可以使用Mutiny APIs来处理下游的信息和错误。

source: If you require a higher level of support, you have options.
zh_cn: 如果您需要更高级别的支持，您可以选择。

source: If you see the following invalid path error for your application JAR when trying to create a native executable using a container build, even though your JAR was built successfully, you're most likely using a remote daemon for your container runtime.
zh_cn: 如果你在试图使用容器构建创建原生可执行文件时，尽管你的JAR已经成功构建，仍看到应用程序JAR出现以下无效路径错误，您很可能为容器运行时使用了一个远程守护进程。

source: If you send objects with this AMQP connector (outbound connector), it gets encoded as JSON and sent as binary. The `content-type` is set to `application/json`. So, you can rebuild the object as follows:
zh_cn: 如果你用这个AMQP连接器（出站连接器）发送对象，它会被编码为JSON，并以二进制形式发送。 `content-type` 被设置为 `application/json` 。因此，你可以按以下方式重建对象。

source: If you set `quarkus.oidc.client-id` but your endpoint does not require remote access to one of OpenID Connect Provider endpoints (introspection, token acquisition, etc.) then do not set a client secret with the `quarkus.oidc.credentials` or similar properties as it will not be used.
zh_cn: 如果你设置了 `quarkus.oidc.client-id` ，但你的端点不需要远程访问OpenID Connect提供者的一个端点（自省、令牌获取等），那么就不要设置带有 `quarkus.oidc.credentials` 或类似属性的客户秘钥，因为它不会被使用。

source: If you share your test class between JVM and native executions like we advise above, you can mark certain tests with the `@DisabledOnIntegrationTest` annotation in order to skip them when testing against a native image.
zh_cn: 如果你像我们上面建议的那样，在JVM和原生执行之间共享测试类，你可以用 `@DisabledOnNativeImage` 注解标记某些测试，被标注的测试只在JVM上运行。

source: If you share your test class between JVM and native executions like we advise above, you can mark certain tests with the `@DisabledOnNativeImage` annotation in order to only run them on the JVM.
zh_cn: 如果你像我们上面建议的那样，在JVM和原生执行之间共享你的测试类，你可以用 `@DisabledOnNativeImage` 注解标记某些测试，以便只在JVM上运行。

source: If you stopped the application (keep in mind you don't have to do it, changes will be automatically deployed by our live reload feature), restart the application with:
zh_cn: 如果你停止了应用程序（请记住，你不必这样做，变化将由我们的实时重载功能自动部署），用以下方法重新启动应用程序:

source: If you use <<dev-services,Dev Services>>, launching the container manually is not necessary!
zh_cn: 如果你使用 link:#dev-services[开发服务] ，则不需要手动启动容器！

source: If you use Hibernate Reactive, look at <<persisting-kafka-messages-with-hibernate-reactive>>.
zh_cn: 如果您使用Hibernate Reactive，请参看 link:#persisting-kafka-messages-with-hibernate-reactive[[使用Hibernate Reactive持久化Kafka消息]] 。

source: If you use Hibernate Reactive, look at <<writing-entities-managed-by-hibernate-reactive-to-kafka>>.
zh_cn: 如果您使用Hibernate Reactive，请参看link:#writing-entities-managed-by-hibernate-reactive-to-kafka[[将hibernate reactive管理的实体写入kafka]] 。

source: If you use Keycloak and Bearer tokens then also see the xref:security-keycloak-authorization.adoc[Using Keycloak to Centralize Authorization] guide.
zh_cn: 如果使用 Keycloak 和 不记名(Bearer) 令牌，则另请参阅 xref:security-keycloak-authorization.adoc[使用 Keycloak 集中授权]指南。

source: If you use MongoDB with Panache in conjunction with RESTEasy Reactive, you can directly return a reactive type inside your JAX-RS resource endpoint.
zh_cn: 如果您将MongoDB和Panache和RESTEasy Reactive结合使用，您可以直接在JAX-RS资源端点内返回一个响应式类型。

source: If you use `Basic` or `Form` HTTP-based authentication then you must add an `IdentityProvider` instance that can convert a username and password to a `SecurityIdentity` instance.
zh_cn: 如果您使用基于 `Basic` 或 `Form` HTTP的认证，那么您必须添加一个 `IdentityProvider` 实例，它可以将用户名和密码转换成 `SecurityIdentity` 实例。

source: If you use the AMQP connector with the `quarkus-smallrye-health` extension, it contributes to the readiness and liveness probes. The AMQP connector reports the readiness and liveness of each channel managed by the connector. At the moment, the AMQP connector uses the same logic for the readiness and liveness checks.
zh_cn: 如果你将AMQP连接器与 `quarkus-smallrye-health` 扩展一起使用，它将有助于就绪性和活跃度探测。AMQP连接器报告连接器所管理的每个通道的就绪性和活跃度。目前，AMQP连接器对就绪性和活跃度检查使用同样的逻辑。

source: If you use the MicroProfile Metrics API in your application, the Micrometer extension will create an adaptive layer to map those metrics into the Micrometer registry. Note that naming conventions between the two systems is different, so the metrics that are emitted when using MP Metrics with Micrometer will change. You can use a `MeterFilter` to remap names or tags according to your conventions.
zh_cn: 如果您在您的应用程序中使用MicroProfile Metrics API，Micrometer扩展将创建一个自适应层l来把这些metrics映射到Micrometer registry中。注意，两个系统之间的命名规则是不同的，所以在Micrometer中使用MP Metrics时发出的metrics将发生变化。您可以使用 `MeterFilter` ，根据您的规范重新映射名称或标签。

source: If you use the Mutiny-variant of Vert.x, be aware that the `deployVerticle` method returns a `Uni`, and you would need to trigger a subscription to make the actual deployment.
zh_cn: 如果你使用Vert.x的Mutiny-variant，请注意 `deployVerticle` 方法返回一个 `Uni` ，你需要触发一个订阅来进行实际部署。

source: If you use the standard `ObjectId` ID type, don't forget to retrieve your entity by creating a new `ObjectId` when the identifier comes from a path parameter. For example:
zh_cn: 如果你使用标准的 `ObjectId` ID类型，当标识符来自路径参数时，不要忘记通过创建一个新的 `ObjectId` 来检索你的实体。例如：

source: If you use xref:redis-dev-services.adoc[Dev Services for Redis], launching the container manually is not necessary!
zh_cn: 如果你使用 link:redis-dev-services.html[Dev Services for Redis] ，则无需手动启动Redis服务容器。

source: If you want a lower memory footprint and faster initialization times for your lambda, you can compile your Java code to a native executable. Just make sure to rebuild your project with the `-Pnative` switch.
zh_cn: 如果你想让你的lambda有更低的内存占用和更快的初始化时间，你可以把你的Java代码编译成本地可执行文件。只是确保要用 `-Pnative` 开关重建你的项目。

source: If you want to access the Kafka record objects directly, use:
zh_cn: 如果您想直接访问Kafka record对象，请使用：

source: If you want to build a native executable, make sure you have GraalVM installed correctly and just add a `native` property to the build
zh_cn: 如果你想构建一个本地可执行文件，请确保你已经正确安装了GraalVM，并且只需向构建添加一个 `native` 属性

source: If you want to continue on this topic check:
zh_cn: 如果你想继续这个话题，请检查：

source: If you want to deploy every exposed `AbstractVerticle`, you can use:
zh_cn: 如果你想部署每个暴露的 `AbstractVerticle` ，你可以使用：

source: If you want to deploy your application somewhere (typically in a container), you need to deploy the whole `quarkus-app` directory.
zh_cn: 如果你想把你的应用程序部署到某个地方（通常是在一个容器中），你需要部署整个 `quarkus-app` 目录。

source: If you want to deserialize a list of fruits, you need to create a deserializer with a Jackson `TypeReference` denoted the generic collection used.
zh_cn: 如果您想反序列化一个fruit对象列表，您需要创建一个反序列化器，它会用Jackson `TypeReference` 表示所用到的通用集合。

source: If you want to deserialize a list of fruits, you need to create a deserializer with a `Type` denoted the generic collection used.
zh_cn: 如果您想反序列化一个fruit对象列表，您需要创建一个反序列化器，它会用一个 `Type` 表示所用到的通用集合。

source: If you want to disable this behavior and fetch resources during startup, you can use the following configuration:
zh_cn: 如果您想禁用这种行为，并在启动期间获取资源，您可以使用以下配置：

source: If you want to go further, check the documentation of https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging], the implementation used in Quarkus.
zh_cn: 如果您想更进一步，请参看link:https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging]，在Quarkus中使用的实现。

source: If you want to go native, there's an environment variable that must be set for native GraalVM deployments. If you look at `sam.native.yaml` you'll see this:
zh_cn: 如果你想使用原生，那么必须为本地GraalVM部署设置一个环境变量。如果你看一下 `sam.native.yaml` ，你会看到这个变量：

source: If you want to hand code raw events for the AWS HTTP API, the AWS Lambda library has the request event type which is `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPEvent` and the response event type of `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPResponse`. This corresponds to the `quarkus-amazon-lambda-http` extension and the AWS HTTP API.
zh_cn: 如果你想为AWS HTTP API手工编码原始事件，AWS Lambda库有请求事件类型，是 `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPEvent` ，响应事件类型是 `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPResponse` 。这与 `quarkus-amazon-lambda-http` 扩展和AWS HTTP API相对应。

source: If you want to hand code raw events for the AWS REST API, Quarkus has its own implementation: `io.quarkus.amazon.lambda.http.model.AwsProxyRequest` and `io.quarkus.amazon.lambda.http.model.AwsProxyResponse`. This corresponds to `quarkus-amazon-lambda-rest` extension and the AWS REST API.
zh_cn: 如果你想为AWS REST API手工编码原始事件，Quarkus有自己的实现： `io.quarkus.amazon.lambda.http.model.AwsProxyRequest` 和 `io.quarkus.amazon.lambda.http.model.AwsProxyResponse` 。这与 `quarkus-amazon-lambda-rest` 扩展和AWS REST API相对应。

source: If you want to process all the records from a topic (from its beginning), you need:
zh_cn: 如果您想处理一个topic中的所有记录(从其最开始时)，您需要：

source: If you want to simulate more complex API Gateway events in your tests, then manually do an HTTP POST to `http://localhost:8080/\_lambda_` (port 8081 in test mode) with the raw API Gateway json events. These events will be placed directly on the Quarkus Lambda poll loop for processing. Here's an example of that:
zh_cn: 如果你想在你的测试中模拟更复杂的API Gateway事件，那么请使用API Gateway json事件手动对 `http://localhost:8080/\_lambda_` (测试模式下的8081端口)做一个HTTP POST。这些事件将被直接放在Quarkus Lambda轮询循环中进行处理。下面是一个例子：
